In [1]:
import pandas as pd

In [7]:
df = pd.read_excel(r'C:\Users\ddugky\Downloads\Olymic_data\groupbydata.xlsx')

In [8]:
df.head()

  Name  Age  Marks
0    A   21     45
1    B   21     89
2    C   21     89
3    D   32     89
4    E   32     45

In [23]:
df.groupby('Marks').get_group(89)

  Name  Age  Marks
1    B   21     89
2    C   21     89
3    D   32     89

In [13]:
x

  Name  Age  Marks
0    A   21     45
1    B   21     89
2    C   21     89